input yours message
